Revit 2027 API
Wave.WaveRandomSeed Property
 The property labeled "Random Seed" from the "Wave" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string WaveRandomSeed { get; }
Public Shared ReadOnly Property WaveRandomSeed As String
	Get
public:
static property String^ WaveRandomSeed {
	String^ get ();
}
static member WaveRandomSeed : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyInteger" within the range of "0, 65535".
See Also
Reference
Wave Class
Autodesk.Revit.DB.Visual Namespace